
** language difference(macros! to solve)
#+begin_src emacs-lisp
;; (defmacro set-company-backends-for! (mode &rest backends)
;;   "Set `company-backends' for MODE with BACKENDS."
;;   `(add-hook (intern (format "%s-hook" ',mode))
;;              (lambda ()
;;                (company-mode +1)
;;                (setq-local company-backends ',backends))))

(defmacro shut-up! (func)
  "Silence FUNC."
  `(advice-add ,func :around
               (defun ,(intern (format "shut-up-%s" func)) (f &rest args)
                 (let ((inhibit-message t))
                   (ignore-errors (apply f args))))))

(defmacro lazy! (&rest body)
  "Delay the evaluation of BODY."
  `(lambda ()
     ,@body))



#+end_src

#+RESULTS:
: lazy!

*** consult
vertico orderless
#+begin_src emacs-lisp
(setq enable-recursive-minibuffers t)

(use-package vertico
  :hook (after-init . vertico-mode)
  :config
  (setq vertico-count 8)
  (face-spec-set 'vertico-current
                 '((((background light))
                    :background "#d8d8d8" :extend t)
                   (t
                    :background "#454545" :extend t))
                 'face-defface-spec))

(use-package orderless
  :config
  (setq
   completion-styles '(orderless)
   completion-category-defaults nil
   completion-category-overrides '((file (styles partial-completion)))))

(global-unset-key (kbd "C-s"))


(use-package consult
  ;; Replace bindings. Lazily loaded due by `use-package'.
  :bind (;; C-x bindings (ctl-x-map)
         ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
         ;; ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
         ;; ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
         ;; ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
         ;; Custom M-# bindings for fast register access
         ;;         ("M-#" . consult-register-load)
         ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("C-M-'" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ("<help> a" . consult-apropos)            ;; orig. apropos-command
         ;; M-g bindings (goto-map)
         ("M-g e" . consult-compile-error)
         ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("M-g g" . consult-goto-line)             ;; orig. goto-line
         ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
         ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
         ("M-g m" . consult-mark)
         ("M-g k" . consult-global-mark)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ;; C-s bindings (search-map)
         ("C-s d" . consult-find)
         ("C-s D" . consult-locate)
         ("C-s g" . consult-grep)
         ("C-s G" . consult-git-grep)
         ("C-s r" . consult-ripgrep)
         ("C-s l" . consult-line)
         ("C-s L" . consult-line-multi)
         ("C-s m" . consult-multi-occur)
         ("C-s k" . consult-keep-lines)
         ("C-s u" . consult-focus-lines))

  :hook (completion-list-mode . consult-preview-at-point-mode)
  :init
  (setq register-preview-delay 0
        register-preview-function #'consult-register-format)
  (advice-add #'register-preview :override #'consult-register-window)
  (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)
  :custom
  (consult-fontify-preserve nil)
  (consult-async-min-input 2)
  (consult-async-refresh-delay 0.15)
  (consult-async-input-throttle 0.2)
  (consult-async-input-debounce 0.1)
  (consult-project-root-function #'projectile-project-root)
  (defun consult-buffer ()
    (interactive)
    (consult--multi consult-buffer-sources
                    :require-match
                    (confirm-nonexistent-file-or-buffer)
                    :prompt "Switch to: "
                    :history 'consult--buffer-history
                    :sort nil))


  )

(setq minibuffer-prompt-properties '(read-only t cursor-intangible t face minibuffer-prompt))
(add-hook 'minibuffer-set-up-hook #'cursor-intangible-mode)
#+end_src

#+RESULTS:
| cursor-intangible-mode |

** window
#+begin_src emacs-lisp
(setq split-height-threshold nil)         ;don't split vertically

;; Customize popwin behavior
(use-package shackle                    ;*customize* not working?
  :ensure t
  :hook (after-init . shackle-mode)
  :custom
  (shackle-default-size 0.5)
  (shackle-default-alignment 'bellow)
  (shackle-rules '((magit-status-mode    :select t :align right)
                   (magit-log-mode       :select t :align right)
                   ("*quickrun*"         :select t)
                   (profiler-report-mode :select t)
                   (xwidget-webkit-mode  :select t :same t)
                   (apropos-mode         :select t :align right :size 0.2)
                   (help-mode            :select t :align right :size 0.2)
                   (helpful-mode         :select t :align right :size 0.2)
                   (comint-mode          :select t :align right :size 0.2)
                   (grep-mode            :select t :align right)
                   (rg-mode              :select t :align right)
                   (compilation-mode     :select t :align right :size 0.2)
                   ("*devdocs*"          :select t :align right :popup t :size 0.8)
                   ("*Flycheck errors*"         :select t   :align bellow :size 10)
                   ("*Backtrace*"               :select t   :align bellow :size 15)
                   ("*Shell Command Output*"    :select nil :align bellow :size 0.4)
                   ("*Async Shell Command*"     :select nil :align bellow :size 0.4)
                   ("*Org-Babel Error Output*"  :select nil :align bellow :size 0.3)
                   ("*package update results*"  :select nil :align bellow :size 10)
                   ("*Process List*"            :select t   :align bellow :size 0.3)
                   ("*Occur*"                   :select t   :align bellow)
                   ("\\*eldoc\\( for \\)?.*\\*" :select nil :align bellow :size 15 :regexp t))))

;; All `temp-buffer's, e.g. *Completions*, will never mess up window layout.
(use-package help
  :ensure nil
  :hook (after-init . temp-buffer-resize-mode)
  :custom
  (help-window-select t))

#+end_src

#+RESULTS:
| projectile-mode | show-paren-mode | temp-buffer-resize-mode | shackle-mode | vertico-mode | recentf-mode | save-place-mode | global-auto-revert-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | table--make-cell-map | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version |

** rainbow delimiters(parenthesis)
((t
  (:weight ultra-bold :foreground "#ff6c6b" :background "#1B2229")))
#+begin_src emacs-lisp
(use-package paren
  :ensure nil
  :hook (after-init . show-paren-mode)
  :init (setq show-paren-when-point-inside-paren t
              show-paren-when-point-in-periphery t
              show-paren-highlight-openparen t))
;; don't you think it's a little to shine?
(use-package rainbow-delimiters
  :config
  (set-face-foreground 'rainbow-delimiters-depth-1-face "DarkOrange") ;lazycat
  (set-face-foreground 'rainbow-delimiters-depth-2-face "DeepSkyBlue")
  (set-face-foreground 'rainbow-delimiters-depth-3-face "DarkRed")
  ;; (set-face-foreground 'rainbow-delimiters-depth-1-face "gold")
  ;; (set-face-foreground 'rainbow-delimiters-depth-2-face "DodgerBlue1")
  ;; (set-face-foreground 'rainbow-delimiters-depth-3-face "lime green")
  ;; (set-face-bold 'rainbow-delimiters-depth-1-face "t")
  ;; (set-face-bold 'rainbow-delimiters-depth-2-face "t")
  :hook
  ((prog-mode . rainbow-delimiters-mode)
   (shell-mode . rainbow-delimiters-mode)
;;   (text-mode . rainbow-delimiters-mode)
   ))
;; (set-face-foreground 'rainbow-delimiters-depth-4-face "deep pink")
;; (set-face-foreground 'rainbow-delimiters-depth-5-face "DarkOrange2")
;; (set-face-foreground 'rainbow-delimiters-depth-6-face "turquoise")
;; (set-face-foreground 'rainbow-delimiters-depth-7-face "medium orchid")
;; (set-face-foreground 'rainbow-delimiters-depth-8-face "chartreuse3")
;; (set-face-foreground 'rainbow-delimiters-depth-9-face "cyan")


#+end_src

#+RESULTS:
| rainbow-delimiters-mode | text-mode-hook-identify |

*** export
#+BEGIN_SRC emacs-lisp
(use-package htmlize)

(with-eval-after-load 'org
  (setq org-odt-preferred-output-format "docx") ;ODT转换格式默认为docx
  (setq org-startup-folded nil)                 ;默认展开内容

  (defun org-export-docx ()
    (interactive)
    (let ((docx-file (concat (file-name-sans-extension (buffer-file-name)) ".docx"))
          (template-file (concat (file-name-as-directory lazycat-emacs-root-dir)
                                 (file-name-as-directory "template")
                                 "template.docx")))
      (shell-command (format "pandoc %s -o %s --reference-doc=%s"
                             (buffer-file-name)
                             docx-file
                             template-file
                             ))
      (message "Convert finish: %s" docx-file))))

;; (use-package ox-reveal
;;   :commands (org-reveal)
;;   :init
;;   (add-hook 'after-init-hook #'org-reveal)
;;   :config
;;   (setq org-reveal-root "~/.reveal.js"
;;    org-reveal-theme "moon"
;;    org-reveal-plugins '(classList markdown zoom notes)
;;    ))

(setq org-export-headline-levels 1
      org-export-with-broken-links 'mark
      org-export-with-section-numbers nil
      org-html-checkbox-type 'html
      org-html-doctype "html5"
      org-html-html5-fancy t)
(require 'ox-latex)
(add-to-list 'org-latex-packages-alist '("" "listings"))
(add-to-list 'org-latex-packages-alist '("" "color"))
 #+END_SRC

 #+RESULTS:
 | ( color) | ( listings) | \usepackage{ctex} |
** structured text(md, rst)
#+begin_src emacs-lisp
;; Pixel alignment for org/markdown tables
(use-package valign
  :ensure t
  :hook ((markdown-mode org-mode) . valign-mode))

;; The markdown mode is awesome! unbeatable
(use-package markdown-mode
  :ensure t
  :init
  (advice-add #'markdown--command-map-prompt :override #'ignore)
  (advice-add #'markdown--style-map-prompt   :override #'ignore)
  :mode ("README\\(?:\\.md\\)?\\'" . gfm-mode)
  :hook (markdown-mode . visual-line-mode)
  :bind (:map markdown-mode-style-map
         ("r" . markdown-insert-ruby-tag)
         ("d" . markdown-insert-details))
  :config
  (defun markdown-insert-ruby-tag (text ruby)
    "Insert ruby tag with `TEXT' and `RUBY' quickly."
    (interactive "sText: \nsRuby: \n")
    (insert (format "<ruby>%s<rp>(</rp><rt>%s</rt><rp>)</rp></ruby>" text ruby)))

  (defun markdown-insert-details (title)
    "Insert details tag (collapsible) quickly."
    (interactive "sTitle: ")
    (insert (format "<details><summary>%s</summary>\n\n</details>" title)))
  :custom
  (markdown-header-scaling t)
  (markdown-enable-wiki-links t)
  (markdown-italic-underscore t)
  (markdown-asymmetric-header t)
  (markdown-gfm-uppercase-checkbox t)
  (markdown-fontify-code-blocks-natively t))

;; ReStructuredText
(use-package rst
  :ensure nil
  :hook ((rst-mode . visual-line-mode)
         (rst-adjust . rst-toc-update)))

#+end_src

#+RESULTS:
| rst-toc-update |
** dired
#+begin_src emacs-lisp
(setq dired-kill-when-opening-new-dired-buffer t
      dired-auto-revert-buffer #'dired-directory-changed-p
      dired-hide-details-hide-symlink-targets nil)
(setq dired-listing-switches "-AFhlv")  ;wt

;; Make dired colorful
(use-package diredfl
  :ensure t
  :hook (dired-mode . diredfl-mode))


#+end_src

#+RESULTS:
| diredfl-mode | diff-hl-dired-mode-unless-remote |

** lisp
#+begin_src emacs-lisp
;; elisp
(defconst eval-as-comment-prefix ";;=> ")
;; Imitate scala-mode
;; from https://github.com/dakra/dmacs
(defun eval-to-comment (&optional arg)
  (interactive "P")
  (let ((start (point)))
    (eval-print-last-sexp arg)
    (save-excursion
      (goto-char start)
      (save-match-data
        (re-search-forward "[[:space:]\n]+" nil t)
        (insert eval-as-comment-prefix)))))

(define-key emacs-lisp-mode-map "\C-c\C-b" 'eval-buffer)
(define-key emacs-lisp-mode-map "\C-c\C-c" 'eval-to-comment)
(define-key lisp-interaction-mode-map "\C-c\C-c" 'eval-to-comment)


(use-package ielm
  :ensure nil
  :hook (ielm-mode . company-mode))


#+end_src

#+RESULTS:
| company-mode |

** haskell
#+begin_src emacs-lisp
(use-package haskell-mode
  :ensure t
  :hook ((haskell-mode . haskell-indentation-mode)
         (haskell-mode . haskell-doc-mode))
  :custom
  (haskell-completing-read-function 'completing-read)
  (haskell-process-check-cabal-config-on-load nil)
  (haskell-process-suggest-add-package nil)
  (haskell-process-suggest-hoogle-imports nil)
  (haskell-process-suggest-language-pragmas nil)
  (haskell-process-suggest-overloaded-strings nil)
  (haskell-process-suggest-restart nil))


#+end_src

#+RESULTS:
| haskell-doc-mode | haskell-indentation-mode |

** rust
#+begin_src emacs-lisp
(use-package rust-mode
  :defines lsp-rust-server
  :config
  ;; Prefer `rust-analyzer' over `rls'
  (with-eval-after-load 'lsp-mode
    (when (executable-find "rust-analyzer")
      (setq lsp-rust-server 'rust-analyzer)))
  :custom
  (rust-format-on-save (executable-find "rustfmt")))

;; Cargo integration
(use-package cargo
  :ensure t
  :hook (rust-mode . cargo-minor-mode))
#+end_src

#+RESULTS:
| cargo-minor-mode | rust-maybe-initialize-buffer-project |

*** yas
#+begin_src emacs-lisp
(use-package yasnippet)
(add-hook 'prog-mode-hook
          #'(lambda ()
              (require 'yasnippet)

              (defun get-git-user-name ()
                (interactive)
                (replace-regexp-in-string "\n$" "" (shell-command-to-string "git config --get user.name")))

              (defun get-git-user-email ()
                (interactive)
                (replace-regexp-in-string "\n$" "" (shell-command-to-string "git config --get user.email")))

              (add-to-list `yas/root-directory (concat lazycat-emacs-root-dir "/snippets"))
              (yas-global-mode 1)

              ;; Disable yasnippet mode on some mode.
              (dolist (hook (list
                             'term-mode-hook
                             ))
                (add-hook hook #'(lambda () (yas-minor-mode -1))))
              ))

#+end_src

#+RESULTS:
| (lambda nil (require 'yasnippet) (defun get-git-user-name nil (interactive) (replace-regexp-in-string |

*** magit
#+begin_src emacs-lisp
(use-package magit
;;  :hook (git-commit-setup . git-commit-turn-on-flyspell)
  :custom
  (magit-diff-refine-hunk t)            ;what's this?
  (magit-diff-paint-whitespace nil)
  )

(setq magit-commit-ask-to-stage nil)    ;don't ask stage question

(use-package vc
  :custom
  (vc-follow-symlinks t)
  (vc-allow-async-revert t)
  (vc-handled-backends '(Git)))

;; useless and disturbing
;; Highlight uncommitted changes using VC
;; (use-package diff-hl
;;   :ensure t
;;   :hook ((after-init         . global-diff-hl-mode)
;;          (dired-mode         . diff-hl-dired-mode-unless-remote)
;;          (magit-pre-refresh  . diff-hl-magit-pre-refresh)
;;          (magit-post-refresh . diff-hl-magit-post-refresh))
;;   :config
;;   ;; When Emacs runs in terminal, show the indicators in margin instead.
;;   (unless (display-graphic-p)
;;     (diff-hl-margin-mode)))

;; Visual diff interface
(use-package ediff                ;what's this?
  ;; Restore window config after quitting ediff
  :hook ((ediff-before-setup . ediff-save-window-conf)
         (ediff-quit         . ediff-restore-window-conf))
  :config
  (defvar local-ediff-saved-window-conf nil)

  (defun ediff-save-window-conf ()
    (setq local-ediff-saved-window-conf (current-window-configuration)))

  (defun ediff-restore-window-conf ()
    (when (window-configuration-p local-ediff-saved-window-conf)
      (set-window-configuration local-ediff-saved-window-conf)))
  :custom
  (ediff-highlight-all-diffs t)
  (ediff-window-setup-function 'ediff-setup-windows-plain)
  (ediff-split-window-function 'split-window-horizontally)
  (ediff-merge-split-window-function 'split-window-horizontally))

;; will this be influenced by ping?
(use-package browse-at-remote
  :bind (:map vc-prefix-map
         ("b" . bar-browse)         ;; was `vc-switch-backend'
         ("c" . bar-to-clipboard))
  :custom
  (browse-at-remote-add-line-number-if-no-region-selected nil))

;; Setup gitignore mode
(use-package conf-mode
  :ensure nil
  :mode (("\\.gitignore\\'"     . conf-unix-mode)
         ("\\.gitconfig\\'"     . conf-unix-mode)
         ("\\.gitattributes\\'" . conf-unix-mode)))


#+end_src

#+RESULTS:
: ((\.gitattributes\' . conf-unix-mode) (\.gitconfig\' . conf-unix-mode) (\.gitignore\' . conf-unix-mode) (\(?:\(?:\.\(?:b\(?:\(?:abel\|ower\)rc\)\|json\(?:ld\)?\)\|composer\.lock\)\'\) . json-mode) (README\(?:\.md\)?\' . gfm-mode) (\.odc\' . archive-mode) (\.odf\' . archive-mode) (\.odi\' . archive-mode) (\.otp\' . archive-mode) (\.odp\' . archive-mode) (\.otg\' . archive-mode) (\.odg\' . archive-mode) (\.ots\' . archive-mode) (\.ods\' . archive-mode) (\.odm\' . archive-mode) (\.ott\' . archive-mode) (\.odt\' . archive-mode) (\.jison\' . jison-mode) (\.l\' . flex-mode) (\.y\' . bison-mode) (\.cmake\' . cmake-mode) (CMakeLists\.txt\' . cmake-mode) (/crontab\(\.X*[[:alnum:]]+\)?\' . crontab-mode) (\.cs\' . csharp-mode) (/fish_funced\..*\' . fish-mode) (\.fish\' . fish-mode) (\.gv\' . graphviz-dot-mode) (\.dot\' . graphviz-dot-mode) (\.hsc\' . haskell-mode) (\.l[gh]s\' . haskell-literate-mode) (\.hsig\' . haskell-mode) (\.[gh]s\' . haskell-mode) (\.cabal\'\|/cabal\.project\|/\.cabal/config\' . haskell-cabal-mode) (\.chs\' . haskell-c2hs-mode) (\.ghci\' . ghci-script-mode) (\.dump-simpl\' . ghc-core-mode) (\.hcr\' . ghc-core-mode) (\.lox\' . lox-mode) (/git-rebase-todo\' . git-rebase-mode) (\.\(?:md\|markdown\|mkd\|mdown\|mkdn\|mdwn\)\' . markdown-mode) (\.\(?:php[s345]?\|phtml\)\' . php-mode-maybe) (\.\(?:php\.inc\|stub\)\' . php-mode) (/\.php_cs\(?:\.dist\)?\' . php-mode) (\.rs\' . rust-mode) (\.gpg\(~\|\.~[0-9]+~\)?\' nil epa-file) (\.elc\' . elisp-byte-code-mode) (\.zst\' nil jka-compr) (\.dz\' nil jka-compr) (\.xz\' nil jka-compr) (\.lzma\' nil jka-compr) (\.lz\' nil jka-compr) (\.g?z\' nil jka-compr) (\.bz2\' nil jka-compr) (\.Z\' nil jka-compr) (\.vr[hi]?\' . vera-mode) (\(?:\.\(?:rbw?\|ru\|rake\|thor\|jbuilder\|rabl\|gemspec\|podspec\)\|/\(?:Gem\|Rake\|Cap\|Thor\|Puppet\|Berks\|Brew\|Vagrant\|Guard\|Pod\)file\)\' . ruby-mode) (\.re?st\' . rst-mode) (\.py[iw]?\' . python-mode) (\.m\' . octave-maybe-mode) (\.less\' . less-css-mode) (\.scss\' . scss-mode) (\.awk\' . awk-mode) (\.\(u?lpc\|pike\|pmod\(\.in\)?\)\' . pike-mode) (\.idl\' . idl-mode) (\.java\' . java-mode) (\.m\' . objc-mode) (\.ii\' . c++-mode) (\.i\' . c-mode) (\.lex\' . c-mode) (\.y\(acc\)?\' . c-mode) (\.h\' . c-or-c++-mode) (\.c\' . c-mode) (\.\(CC?\|HH?\)\' . c++-mode) (\.[ch]\(pp\|xx\|\+\+\)\' . c++-mode) (\.\(cc\|hh\)\' . c++-mode) (\.\(bat\|cmd\)\' . bat-mode) (\.[sx]?html?\(\.[a-zA-Z_]+\)?\' . mhtml-mode) (\.svgz?\' . image-mode) (\.svgz?\' . xml-mode) (\.x[bp]m\' . image-mode) (\.x[bp]m\' . c-mode) (\.p[bpgn]m\' . image-mode) (\.tiff?\' . image-mode) (\.gif\' . image-mode) (\.png\' . image-mode) (\.jpe?g\' . image-mode) (\.webp\' . image-mode) (\.te?xt\' . text-mode) (\.[tT]e[xX]\' . tex-mode) (\.ins\' . tex-mode) (\.ltx\' . latex-mode) (\.dtx\' . doctex-mode) (\.org\' . org-mode) (\.dir-locals\(?:-2\)?\.el\' . lisp-data-mode) (eww-bookmarks\' . lisp-data-mode) (tramp\' . lisp-data-mode) (/archive-contents\' . lisp-data-mode) (places\' . lisp-data-mode) (\.emacs-places\' . lisp-data-mode) (\.el\' . emacs-lisp-mode) (Project\.ede\' . emacs-lisp-mode) (\.\(scm\|stk\|ss\|sch\)\' . scheme-mode) (\.l\' . lisp-mode) (\.li?sp\' . lisp-mode) (\.[fF]\' . fortran-mode) (\.for\' . fortran-mode) (\.p\' . pascal-mode) (\.pas\' . pascal-mode) (\.\(dpr\|DPR\)\' . delphi-mode) (\.\([pP]\([Llm]\|erl\|od\)\|al\)\' . perl-mode) (Imakefile\' . makefile-imake-mode) (Makeppfile\(?:\.mk\)?\' . makefile-makepp-mode) (\.makepp\' . makefile-makepp-mode) (\.mk\' . makefile-gmake-mode) (\.make\' . makefile-gmake-mode) ([Mm]akefile\' . makefile-gmake-mode) (\.am\' . makefile-automake-mode) (\.texinfo\' . texinfo-mode) (\.te?xi\' . texinfo-mode) (\.[sS]\' . asm-mode) (\.asm\' . asm-mode) (\.css\' . css-mode) (\.mixal\' . mixal-mode) (\.gcov\' . compilation-mode) (/\.[a-z0-9-]*gdbinit . gdb-script-mode) (-gdb\.gdb . gdb-script-mode) ([cC]hange\.?[lL]og?\' . change-log-mode) ([cC]hange[lL]og[-.][0-9]+\' . change-log-mode) (\$CHANGE_LOG\$\.TXT . change-log-mode) (\.scm\.[0-9]*\' . scheme-mode) (\.[ckz]?sh\'\|\.shar\'\|/\.z?profile\' . sh-mode) (\.bash\' . sh-mode) (/PKGBUILD\' . sh-mode) (\(/\|\`\)\.\(bash_\(profile\|history\|log\(in\|out\)\)\|z?log\(in\|out\)\)\' . sh-mode) (\(/\|\`\)\.\(shrc\|zshrc\|m?kshrc\|bashrc\|t?cshrc\|esrc\)\' . sh-mode) (\(/\|\`\)\.\([kz]shenv\|xinitrc\|startxrc\|xsession\)\' . sh-mode) (\.m?spec\' . sh-mode) (\.m[mes]\' . nroff-mode) (\.man\' . nroff-mode) (\.sty\' . latex-mode) (\.cl[so]\' . latex-mode) (\.bbl\' . latex-mode) (\.bib\' . bibtex-mode) (\.bst\' . bibtex-style-mode) (\.sql\' . sql-mode) (\(acinclude\|aclocal\|acsite\)\.m4\' . autoconf-mode) (\.m[4c]\' . m4-mode) (\.mf\' . metafont-mode) (\.mp\' . metapost-mode) (\.vhdl?\' . vhdl-mode) (\.article\' . text-mode) (\.letter\' . text-mode) (\.i?tcl\' . tcl-mode) (\.exp\' . tcl-mode) (\.itk\' . tcl-mode) (\.icn\' . icon-mode) (\.sim\' . simula-mode) (\.mss\' . scribe-mode) (\.f9[05]\' . f90-mode) (\.f0[38]\' . f90-mode) (\.indent\.pro\' . fundamental-mode) (\.\(pro\|PRO\)\' . idlwave-mode) (\.srt\' . srecode-template-mode) (\.prolog\' . prolog-mode) (\.tar\' . tar-mode) (\.\(arc\|zip\|lzh\|lha\|zoo\|[jew]ar\|xpi\|rar\|cbr\|7z\|squashfs\|ARC\|ZIP\|LZH\|LHA\|ZOO\|[JEW]AR\|XPI\|RAR\|CBR\|7Z\|SQUASHFS\)\' . archive-mode) (\.oxt\' . archive-mode) (\.\(deb\|[oi]pk\)\' . archive-mode) (\`/tmp/Re . text-mode) (/Message[0-9]*\' . text-mode) (\`/tmp/fol/ . text-mode) (\.oak\' . scheme-mode) (\.sgml?\' . sgml-mode) (\.x[ms]l\' . xml-mode) (\.dbk\' . xml-mode) (\.dtd\' . sgml-mode) (\.ds\(ss\)?l\' . dsssl-mode) (\.js[mx]?\' . javascript-mode) (\.har\' . javascript-mode) (\.json\' . javascript-mode) (\.[ds]?va?h?\' . verilog-mode) (\.by\' . bovine-grammar-mode) (\.wy\' . wisent-grammar-mode) (\.erts\' . erts-mode) ([:/\]\..*\(emacs\|gnus\|viper\)\' . emacs-lisp-mode) (\`\..*emacs\' . emacs-lisp-mode) ([:/]_emacs\' . emacs-lisp-mode) (/crontab\.X*[0-9]+\' . shell-script-mode) (\.ml\' . lisp-mode) (\.ld[si]?\' . ld-script-mode) (ld\.?script\' . ld-script-mode) (\.xs\' . c-mode) (\.x[abdsru]?[cnw]?\' . ld-script-mode) (\.zone\' . dns-mode) (\.soa\' . dns-mode) (\.asd\' . lisp-mode) (\.\(asn\|mib\|smi\)\' . snmp-mode) (\.\(as\|mi\|sm\)2\' . snmpv2-mode) (\.\(diffs?\|patch\|rej\)\' . diff-mode) (\.\(dif\|pat\)\' . diff-mode) (\.[eE]?[pP][sS]\' . ps-mode) (\.\(?:PDF\|EPUB\|CBZ\|FB2\|O?XPS\|DVI\|OD[FGPST]\|DOCX\|XLSX?\|PPTX?\|pdf\|epub\|cbz\|fb2\|o?xps\|djvu\|dvi\|od[fgpst]\|docx\|xlsx?\|pptx?\)\' . doc-view-mode-maybe) (configure\.\(ac\|in\)\' . autoconf-mode) (\.s\(v\|iv\|ieve\)\' . sieve-mode) (BROWSE\' . ebrowse-tree-mode) (\.ebrowse\' . ebrowse-tree-mode) (#\*mail\* . mail-mode) (\.g\' . antlr-mode) (\.mod\' . m2-mode) (\.ses\' . ses-mode) (\.docbook\' . sgml-mode) (\.com\' . dcl-mode) (/config\.\(?:bat\|log\)\' . fundamental-mode) (/\.\(authinfo\|netrc\)\' . authinfo-mode) (\.\(?:[iI][nN][iI]\|[lL][sS][tT]\|[rR][eE][gG]\|[sS][yY][sS]\)\' . conf-mode) (\.la\' . conf-unix-mode) (\.ppd\' . conf-ppd-mode) (java.+\.conf\' . conf-javaprop-mode) (\.properties\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-javaprop-mode) (\.toml\' . conf-toml-mode) (\.desktop\' . conf-desktop-mode) (/\.redshift\.conf\' . conf-windows-mode) (\`/etc/\(?:DIR_COLORS\|ethers\|.?fstab\|.*hosts\|lesskey\|login\.?de\(?:fs\|vperm\)\|magic\|mtab\|pam\.d/.*\|permissions\(?:\.d/.+\)?\|protocols\|rpc\|services\)\' . conf-space-mode) (\`/etc/\(?:acpid?/.+\|aliases\(?:\.d/.+\)?\|default/.+\|group-?\|hosts\..+\|inittab\|ksysguarddrc\|opera6rc\|passwd-?\|shadow-?\|sysconfig/.+\)\' . conf-mode) ([cC]hange[lL]og[-.][-0-9a-z]+\' . change-log-mode) (/\.?\(?:gitconfig\|gnokiirc\|hgrc\|kde.*rc\|mime\.types\|wgetrc\)\' . conf-mode) (/\.\(?:asound\|enigma\|fetchmail\|gltron\|gtk\|hxplayer\|mairix\|mbsync\|msmtp\|net\|neverball\|nvidia-settings-\|offlineimap\|qt/.+\|realplayer\|reportbug\|rtorrent\.\|screen\|scummvm\|sversion\|sylpheed/.+\|xmp\)rc\' . conf-mode) (/\.\(?:gdbtkinit\|grip\|mpdconf\|notmuch-config\|orbital/.+txt\|rhosts\|tuxracer/options\)\' . conf-mode) (/\.?X\(?:default\|resource\|re\)s\> . conf-xdefaults-mode) (/X11.+app-defaults/\|\.ad\' . conf-xdefaults-mode) (/X11.+locale/.+/Compose\' . conf-colon-mode) (/X11.+locale/compose\.dir\' . conf-javaprop-mode) (\.~?[0-9]+\.[0-9][-.0-9]*~?\' nil t) (\.\(?:orig\|in\|[bB][aA][kK]\)\' nil t) ([/.]c\(?:on\)?f\(?:i?g\)?\(?:\.[a-zA-Z0-9._-]+\)?\' . conf-mode-maybe) (\.[1-9]\' . nroff-mode) (\.art\' . image-mode) (\.avs\' . image-mode) (\.bmp\' . image-mode) (\.cmyk\' . image-mode) (\.cmyka\' . image-mode) (\.crw\' . image-mode) (\.dcr\' . image-mode) (\.dcx\' . image-mode) (\.dng\' . image-mode) (\.dpx\' . image-mode) (\.fax\' . image-mode) (\.heic\' . image-mode) (\.hrz\' . image-mode) (\.icb\' . image-mode) (\.icc\' . image-mode) (\.icm\' . image-mode) (\.ico\' . image-mode) (\.icon\' . image-mode) (\.jbg\' . image-mode) (\.jbig\' . image-mode) (\.jng\' . image-mode) (\.jnx\' . image-mode) (\.miff\' . image-mode) (\.mng\' . image-mode) (\.mvg\' . image-mode) (\.otb\' . image-mode) (\.p7\' . image-mode) (\.pcx\' . image-mode) (\.pdb\' . image-mode) (\.pfa\' . image-mode) (\.pfb\' . image-mode) (\.picon\' . image-mode) (\.pict\' . image-mode) (\.rgb\' . image-mode) (\.rgba\' . image-mode) (\.tga\' . image-mode) (\.wbmp\' . image-mode) (\.webp\' . image-mode) (\.wmf\' . image-mode) (\.wpg\' . image-mode) (\.xcf\' . image-mode) (\.xmp\' . image-mode) (\.xwd\' . image-mode) (\.yuv\' . image-mode) (\.tgz\' . tar-mode) (\.tbz2?\' . tar-mode) (\.txz\' . tar-mode) (\.tzst\' . tar-mode))

*** flycheck
#+BEGIN_SRC emacs-lisp
;; flycheck
(use-package flycheck)
;;   :hook (prog-mode . flycheck-mode)
;;   :custom
;;   (flycheck-temp-prefix ".flycheck")
;;   (flycheck-emacs-lisp-load-path 'inherit)
;;   (flycheck-indication-mode 'left-fringe)
;;   (flycheck-idle-change-delay 1)
;;   )

(use-package flycheck-posframe)
;; I don't like `global-flycheck-mode', some mode, such as elisp mode don't need.
(dolist (hook (list
               'c-mode-common-hook
               'ruby-mode-hook
               'python-mode-hook
               'swift-mode-hook
               'go-mode-hook
               'js-mode-hook
               ))
  (add-hook
   hook
   #'(lambda ()
       ;; OS Config
       (when (featurep 'cocoa)
         ;; Initialize environment from user's shell to make eshell know every PATH by other shell.
         (require 'exec-path-from-shell)
         (setq exec-path-from-shell-variables '("PATH" "MANPATH" "GEM_PATH"))
         (exec-path-from-shell-initialize))

       (require 'flycheck)

       (setq-default flycheck-disabled-checkers ;disable json-jsonlist checking for json files
                     (append flycheck-disabled-checkers
                             '(json-jsonlist)))

       (setq-default flycheck-disabled-checkers ;disable jshint since we prefer eslint checking
                     (append flycheck-disabled-checkers
                             '(javascript-jshint)))

       (flycheck-add-mode 'javascript-eslint 'web-mode) ;use eslint with web-mode for jsx files

       (setq-default flycheck-temp-prefix ".flycheck")

       (with-eval-after-load 'flycheck
         (require 'flycheck-posframe)
         (add-hook 'flycheck-mode-hook #'flycheck-posframe-mode))
       (flycheck-mode 1))))

;; Add flycheck for swift.
(add-hook 'swift-mode-hook
          #'(lambda ()
              (require 'flycheck-swift)
              (flycheck-swift-setup)
              ))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (when (featurep 'cocoa) (require 'exec-path-from-shell) (setq exec-path-from-shell-variables '(PATH MANPATH GEM_PATH)) (exec-path-from-shell-initialize))       | (require 'flycheck)    | (setq-default flycheck-disabled-checkers (append flycheck-disabled-checkers '(json-jsonlist)))         | (setq-default flycheck-disabled-checkers (append flycheck-disabled-checkers '(javascript-jshint)))         | (flycheck-add-mode 'javascript-eslint 'web-mode) | (setq-default flycheck-temp-prefix .flycheck)         | (with-eval-after-load 'flycheck (require 'flycheck-posframe) (add-hook 'flycheck-mode-hook #'flycheck-posframe-mode))           | (flycheck-mode 1) |
  | lambda | nil | (require 'flycheck-swift)                                                                                                                                       | (flycheck-swift-setup) |                                                                                                        |                                                                                                            |                                                  |                                                       |                                                                                                                                 |                   |
  | lambda | nil | (if (featurep 'cocoa) (progn (require 'exec-path-from-shell) (setq exec-path-from-shell-variables '(PATH MANPATH GEM_PATH)) (exec-path-from-shell-initialize))) | (require 'flycheck)    | (progn (set-default 'flycheck-disabled-checkers (append flycheck-disabled-checkers '(json-jsonlist)))) | (progn (set-default 'flycheck-disabled-checkers (append flycheck-disabled-checkers '(javascript-jshint)))) | (flycheck-add-mode 'javascript-eslint 'web-mode) | (progn (set-default 'flycheck-temp-prefix .flycheck)) | (eval-after-load 'flycheck #'(lambda nil (require 'flycheck-posframe) (add-hook 'flycheck-mode-hook #'flycheck-posframe-mode))) | (flycheck-mode 1) |
